In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
pwd

'C:\\Users\\SMART-13\\Downloads\\python and database'

In [4]:
selloutdata=pd.read_csv("./dataset/kopo_channel_seasonality_new.csv")
selloutdata.head()

  REGIONID    PRODUCT  YEARWEEK      QTY
0      A60   PRODUCT4    201402     71.0
1      A60  PRODUCT59    201402  22275.0
2      A60  PRODUCT34    201402   4463.0
3      A60  PRODUCT47    201402      0.0
4      A60  PRODUCT56    201402     23.0

In [5]:
selloutdata.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
dtype: object

In [6]:
selloutdata.head(1)

  REGIONID   PRODUCT  YEARWEEK   QTY
0      A60  PRODUCT4    201402  71.0

In [7]:
selloutdata["RESIONID"]=selloutdata["REGIONID"].astype(str)
selloutdata["PRODUCT"]=selloutdata["PRODUCT"].astype(str)
selloutdata["YEARWEEK"]=selloutdata["YEARWEEK"].astype(str)
selloutdata["QTY"]=selloutdata["QTY"].astype(float)

In [8]:
selloutdata.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY         float64
RESIONID     object
dtype: object

In [9]:
selloutdata["YEAR"]=selloutdata.YEARWEEK.astype(str).str[0:4]
selloutdata.head()

  REGIONID    PRODUCT YEARWEEK      QTY RESIONID  YEAR
0      A60   PRODUCT4   201402     71.0      A60  2014
1      A60  PRODUCT59   201402  22275.0      A60  2014
2      A60  PRODUCT34   201402   4463.0      A60  2014
3      A60  PRODUCT47   201402      0.0      A60  2014
4      A60  PRODUCT56   201402     23.0      A60  2014

In [10]:
selloutdata["WEEK"]=selloutdata.YEARWEEK.astype(str).str[4:]
selloutdata.head()

  REGIONID    PRODUCT YEARWEEK      QTY RESIONID  YEAR WEEK
0      A60   PRODUCT4   201402     71.0      A60  2014   02
1      A60  PRODUCT59   201402  22275.0      A60  2014   02
2      A60  PRODUCT34   201402   4463.0      A60  2014   02
3      A60  PRODUCT47   201402      0.0      A60  2014   02
4      A60  PRODUCT56   201402     23.0      A60  2014   02

In [11]:
refinedselloutdata=selloutdata[selloutdata.WEEK.astype(int)<=52]
len(refinedselloutdata)

123864

In [12]:
sortkey=["REGIONID","PRODUCT","YEARWEEK"]
sortkey

['REGIONID', 'PRODUCT', 'YEARWEEK']

In [13]:
sortdata=refinedselloutdata.sort_values(sortkey)
sortdata.head()

     REGIONID    PRODUCT YEARWEEK    QTY RESIONID  YEAR WEEK
298       A00  PRODUCT34   201401  661.0      A00  2014   01
1757      A00  PRODUCT34   201402  679.0      A00  2014   02
3125      A00  PRODUCT34   201403  578.0      A00  2014   03
205       A00  PRODUCT34   201404  532.0      A00  2014   04
4369      A00  PRODUCT34   201405  516.0      A00  2014   05

In [14]:
sortdata=sortdata.reset_index(drop=True)

In [15]:
sortdata.head()

  REGIONID    PRODUCT YEARWEEK    QTY RESIONID  YEAR WEEK
0      A00  PRODUCT34   201401  661.0      A00  2014   01
1      A00  PRODUCT34   201402  679.0      A00  2014   02
2      A00  PRODUCT34   201403  578.0      A00  2014   03
3      A00  PRODUCT34   201404  532.0      A00  2014   04
4      A00  PRODUCT34   201405  516.0      A00  2014   05

In [16]:
groupkey=['RESIONID','PRODUCT','YEAR']

In [17]:
groupdata=sortdata.groupby(groupkey).mean()[["QTY"]]

In [18]:
groupdata.head()

                                QTY
RESIONID PRODUCT   YEAR
A00      PRODUCT34 2014  275.961538
                   2015   86.634615
                   2016   36.576923
         PRODUCT58 2014    2.673077
                   2015    5.711538

In [19]:
groupdata=groupdata.reset_index()

In [20]:
groupdata.head()

  RESIONID    PRODUCT  YEAR         QTY
0      A00  PRODUCT34  2014  275.961538
1      A00  PRODUCT34  2015   86.634615
2      A00  PRODUCT34  2016   36.576923
3      A00  PRODUCT58  2014    2.673077
4      A00  PRODUCT58  2015    5.711538

In [21]:
refinedselloutdata.head()

  REGIONID    PRODUCT YEARWEEK      QTY RESIONID  YEAR WEEK
0      A60   PRODUCT4   201402     71.0      A60  2014   02
1      A60  PRODUCT59   201402  22275.0      A60  2014   02
2      A60  PRODUCT34   201402   4463.0      A60  2014   02
3      A60  PRODUCT47   201402      0.0      A60  2014   02
4      A60  PRODUCT56   201402     23.0      A60  2014   02

In [22]:
groupdata.head()

  RESIONID    PRODUCT  YEAR         QTY
0      A00  PRODUCT34  2014  275.961538
1      A00  PRODUCT34  2015   86.634615
2      A00  PRODUCT34  2016   36.576923
3      A00  PRODUCT58  2014    2.673077
4      A00  PRODUCT58  2015    5.711538

In [23]:
joinkey=["RESIONID","PRODUCT","YEAR"]
joinkey

['RESIONID', 'PRODUCT', 'YEAR']

In [24]:
refinedselloutdata.head()

  REGIONID    PRODUCT YEARWEEK      QTY RESIONID  YEAR WEEK
0      A60   PRODUCT4   201402     71.0      A60  2014   02
1      A60  PRODUCT59   201402  22275.0      A60  2014   02
2      A60  PRODUCT34   201402   4463.0      A60  2014   02
3      A60  PRODUCT47   201402      0.0      A60  2014   02
4      A60  PRODUCT56   201402     23.0      A60  2014   02

In [25]:
groupdata.head()

  RESIONID    PRODUCT  YEAR         QTY
0      A00  PRODUCT34  2014  275.961538
1      A00  PRODUCT34  2015   86.634615
2      A00  PRODUCT34  2016   36.576923
3      A00  PRODUCT58  2014    2.673077
4      A00  PRODUCT58  2015    5.711538

In [26]:
mergedata=pd.merge(refinedselloutdata,groupdata,\
                  left_on=joinkey,right_on=joinkey),\
[["RESIONID","PRODUCT","YEARWEEK","YEAR","WEEK","QTY_NEW","QTY_MEAN"]]

In [27]:
mergedata

(       REGIONID    PRODUCT YEARWEEK  QTY_x RESIONID  YEAR WEEK      QTY_y
 0           A60   PRODUCT4   201402   71.0      A60  2014   02  29.134615
 1           A60   PRODUCT4   201401   16.0      A60  2014   01  29.134615
 2           A60   PRODUCT4   201403   51.0      A60  2014   03  29.134615
 3           A60   PRODUCT4   201406   19.0      A60  2014   06  29.134615
 4           A60   PRODUCT4   201404   21.0      A60  2014   04  29.134615
 5           A60   PRODUCT4   201405   18.0      A60  2014   05  29.134615
 6           A60   PRODUCT4   201407   19.0      A60  2014   07  29.134615
 7           A60   PRODUCT4   201409   18.0      A60  2014   09  29.134615
 8           A60   PRODUCT4   201408   16.0      A60  2014   08  29.134615
 9           A60   PRODUCT4   201411    5.0      A60  2014   11  29.134615
 10          A60   PRODUCT4   201410   12.0      A60  2014   10  29.134615
 11          A60   PRODUCT4   201412   16.0      A60  2014   12  29.134615
 12          A60   PRODUCT4   201413    9.0      A60  2014   13  29.134615
 13          A60   PRODUCT4   201414    9.0      A60  2014   14  29.134615
 14          A60   PRODUCT4   201415   40.0      A60  2014   15  29.134615
 15          A60   PRODUCT4   201417   21.0      A60  2014   17  29.134615
 16          A60   PRODUCT4   201416   25.0      A60  2014   16  29.134615
 17          A60   PRODUCT4   201418   20.0      A60  2014   18  29.134615
 18          A60   PRODUCT4   201420   37.0      A60  2014   20  29.134615
 19          A60   PRODUCT4   201419   31.0      A60  2014   19  29.134615
 20          A60   PRODUCT4   201421   49.0      A60  2014   21  29.134615
 21          A60   PRODUCT4   201422   30.0      A60  2014   22  29.134615
 22          A60   PRODUCT4   201423   45.0      A60  2014   23  29.134615
 23          A60   PRODUCT4   201424   47.0      A60  2014   24  29.134615
 24          A60   PRODUCT4   201425   44.0      A60  2014   25  29.134615
 25          A60   PRODUCT4   201450   20.0      A60  2014   50  29.134615
 26          A60   PRODUCT4   201447   49.0      A60  2014   47  29.134615
 27          A60   PRODUCT4   201428   40.0      A60  2014   28  29.134615
 28          A60   PRODUCT4   201429   38.0      A60  2014   29  29.134615
 29          A60   PRODUCT4   201430   21.0      A60  2014   30  29.134615
 ...         ...        ...      ...    ...      ...   ...  ...        ...
 123834      A28  PRODUCT40   201649    0.0      A28  2016   49   1.884615
 123835      A28  PRODUCT40   201648    4.0      A28  2016   48   1.884615
 123836      A28  PRODUCT40   201651    2.0      A28  2016   51   1.884615
 123837      A28  PRODUCT40   201647    0.0      A28  2016   47   1.884615
 123838      A28  PRODUCT40   201629    1.0      A28  2016   29   1.884615
 123839      A28  PRODUCT40   201634    0.0      A28  2016   34   1.884615
 123840      A28  PRODUCT40   201645    0.0      A28  2016   45   1.884615
 123841      A28  PRODUCT40   201652    0.0      A28  2016   52   1.884615
 123842      A28  PRODUCT40   201633    4.0      A28  2016   33   1.884615
 123843      A28  PRODUCT40   201650    0.0      A28  2016   50   1.884615
 123844      A28  PRODUCT40   201642    0.0      A28  2016   42   1.884615
 123845      A28  PRODUCT40   201636    0.0      A28  2016   36   1.884615
 123846      A28  PRODUCT40   201608    4.0      A28  2016   08   1.884615
 123847      A28  PRODUCT40   201616    0.0      A28  2016   16   1.884615
 123848      A28  PRODUCT40   201637    4.0      A28  2016   37   1.884615
 123849      A28  PRODUCT40   201615    1.0      A28  2016   15   1.884615
 123850      A28  PRODUCT40   201639    6.0      A28  2016   39   1.884615
 123851      A28  PRODUCT40   201611    6.0      A28  2016   11   1.884615
 123852      A28  PRODUCT40   201641    2.0      A28  2016   41   1.884615
 123853      A28  PRODUCT40   201635    2.0      A28  2016   35   1.884615
 123854      A28  PRODUCT40   201638    1.0      A28  2016   38   1.884615
 123855      A28  PRODUCT40   201643    2.0      A28  2016   43   1.884615
 123856      A28  PRODUCT40   201620    0.0      A28  2016   20   1.884615
 123857      A28  PRODUCT40   201640    1.0      A28  2016   40   1.884615
 123858      A28  PRODUCT40   201609   20.0      A28  2016   09   1.884615
 123859      A28  PRODUCT40   201612    0.0      A28  2016   12   1.884615
 123860      A28  PRODUCT40   201632    0.0      A28  2016   32   1.884615
 123861      A28  PRODUCT40   201631    1.0      A28  2016   31   1.884615
 123862      A28  PRODUCT40   201628    4.0      A28  2016   28   1.884615
 123863      A28  PRODUCT40   201627    0.0      A28  2016   27   1.884615

 [123864 rows x 8 columns],
 [['RESIONID', 'PRODUCT', 'YEARWEEK', 'YEAR', 'WEEK', 'QTY_NEW', 'QTY_MEAN']])